Tags:

Query://This need a bit of fixing
let badPipeNames = pack_array('psexesvc','paexec','remcom');
DeviceEvents
| where ActionType == "NamedPipeEvent" 
| extend ParsedFields=parse_json(AdditionalFields)
//| where ParsedFields.FileOperation == "File created"
//tolower(tostring(split(FileName,'\\')[-1]))
|  extend foo = tolower(tostring(split(ParsedFields.PipeName,'\\')[-1]))
| project foo, ParsedFields.PipeName
| where foo in(badPipeNames)
